corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
/*
 * Copyright (c) 2014 - 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*!=================================================================================================
\file       router_eligible_device_app_ota_client.c
\brief      This is a public source file for the router eligible device ota client demo application.
==================================================================================================*/

/*==================================================================================================
Include Files
==================================================================================================*/
/* General Includes */
#include "EmbeddedTypes.h"
#include <string.h>
#include <stdio.h>

/* FSL Framework */
#include "shell.h"
#include "Keyboard.h"
#include "RNG_Interface.h"

/* Network */
#include "ip_if_management.h"
#include "event_manager.h"

/* Application */
#include "router_eligible_device_app_ota_client.h"
#include "shell_ip.h"
#include "thread_utils.h"
#include "thread_meshcop.h"
#include "thread_network.h"
#include "thread_app_callbacks.h"
#include "app_init.h"
#include "app_stack_config.h"
#include "app_thread_config.h"
#include "app_led.h"
#include "app_temp_sensor.h"
#include "coap.h"
#include "app_socket_utils.h"
#include "app_accelerometer.h"
#if THR_ENABLE_EVENT_MONITORING
#include "app_event_monitoring.h"
#endif
#if THR_ENABLE_MGMT_DIAGNOSTICS
#include "thread_mgmt.h"
#include "thci.h"
#endif
#if UDP_ECHO_PROTOCOL
#include "app_echo_udp.h"
#endif
#if gEnableOTAClient_d
#include "app_ota.h"
#endif
#include "Eeprom.h"

#if VT_KW41Z_DEMO
    #include "app_registration.h"
    #if ACCELEROMETER_ENABLE
        #include "app_accelerometer.h"
    #endif /* ACCELEROMETER_ENABLE */
#endif /* VT_KW41Z_DEMO */
#if VT_KW41Z_MENP
    #if RGB_CLICK_ENABLE
        #include "app_RGBClick.h"
    #endif /* RGB_CLICK_ENABLE */
    #if RELAY_CLICK_ENABLE
        #include "app_Relay.h"
    #endif /* RELAY_CLICK_ENABLE */
#endif /* VT_KW41Z_MENP */
#include "app_pct2075_temp_sensor.h"
#include "app_FXAS21002_gyroscope.h"
#include "app_gpio_expander.h"
#include "app_FXLS8972CF_accelerometer.h"

#include "FreeRTOS.h"
#include "task.h"
#include "portmacro.h"

#include "fsl_i2c.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "fsl_port.h"

/*==================================================================================================
Private macros
==================================================================================================*/
#ifndef APP_MSG_QUEUE_SIZE
    #define APP_MSG_QUEUE_SIZE                  20
#endif

#if (THREAD_USE_SHELL == FALSE)
    #define shell_write(a)
    #define shell_refresh()
    #define shell_printf(a,...)
#endif

#define gThrDefaultInstanceId_c                 0
#if APP_AUTOSTART
#define gAppFactoryResetTimeoutMin_c            10000
#define gAppFactoryResetTimeoutMax_c            20000
#endif
#define gAppRestoreLeaderLedTimeout_c           60     /* seconds */

#define gAppJoinTimeout_c                       800    /* miliseconds */

#define APP_LED_URI_PATH                        "/led"
#define APP_TEMP_URI_PATH                       "/temp"
#define APP_SINK_URI_PATH                       "/sink"
#if LARGE_NETWORK
#define APP_RESET_TO_FACTORY_URI_PATH           "/reset"
#endif
#if VT_KW41Z_DEMO
#define APP_KEY_EVENT_URI_PATH                  "/keyevent"
#define APP_FACTORY_RESET                       "/reset"
#if RELAY_CLICK_ENABLE
#define APP_RELAY_URI_PATH                       "/relay"
#endif /* RELAY_CLICK_ENABLE */
#endif /* VT_KW41Z_DEMO */

#define APP_DEFAULT_DEST_ADDR                   in6addr_realmlocal_allthreadnodes

#define APP_CREATE_NWK_IF_JOIN_FAILED           TRUE
#define EXTERNAL_MEMORY_INFORMATION_SIZE        5
#define THR_SW_VERSION_MAX_LEN                  10
#define MAJOR_FW_VERSION_BYTE 3
#define MINOR_FW_VERSION_BYTE 2

//Firmware version storage
union fwVersion {
    uint32_t versionValue;
    uint8_t  versionByte[4];
}currentVersion;

/*==================================================================================================
Private type definitions
==================================================================================================*/

/*==================================================================================================
Private global variables declarations
==================================================================================================*/
static instanceId_t mThrInstanceId = gInvalidInstanceId_c;    /*!< Thread Instance ID */

