corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
static bool_t mFirstPushButtonPressed = FALSE;

static bool_t mJoiningIsAppInitiated = FALSE;

static bool m_bUserLedUpdate;
static uint8_t m_redValue;
static uint8_t m_greenValue;
static uint8_t m_blueValue;

char eui_string[17];	//Zero terminated

#if (AT_COMMAND_SHELL)
static eLED_KEY_USE m_cLedKeyboardUse = atkAUTO;
#endif //AT_COMMAND_SHELL

/*==================================================================================================
Private prototypes
==================================================================================================*/
static void App_HandleKeyboard(void *param);
static void App_UpdateStateLeds(appDeviceState_t deviceState);
static void APP_JoinEventsHandler(thrEvCode_t evCode);
static void APP_InitCoapDemo(void);
static void APP_ReportTemp(void *pParam);
#ifndef FRDM_KW41Z
static void APP_SendDataSinkCreate(void *pParam);
static void APP_SendDataSinkRelease(void *pParam);
#endif
#if !(VT_KW41Z_MENP)
static void APP_SendLedRgbOn(void *pParam);
static void APP_TestCoapMsg(void *pParam);
static void APP_SendLedRgbOff(void *pParam);
static void APP_SendLedFlash(void *pParam);
static void APP_SendLedColorWheel(void *pParam);
#endif /* VT_KW41Z_DEMO */
static void APP_LocalDataSinkRelease(void *pParam);
static void APP_ProcessLedCmd(uint8_t *pCommand, uint8_t dataLen);
static void APP_CoapGenericCallback(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
static void APP_CoapLedCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
static void APP_CoapTempCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
static void APP_CoapSinkCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
#if VT_KW41Z_DEMO
static void APP_Reportkey_event(void *pParam);
static void APP_ReportSensors(char* pSensorString);
static void APP_CoapkeyeventCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
static void APP_CoapresetCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
#endif /* VT_KW41Z_DEMO */
static void App_RestoreLeaderLed(void * param);
#if LARGE_NETWORK
static void APP_CoapResetToFactoryDefaultsCb(coapSessionStatus_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen);
static void APP_SendResetToFactoryCommand(void *param);
#endif
#if APP_AUTOSTART
static void APP_AutoStart(void *param);
static void APP_AutoStartCb(void *param);
#endif

/*==================================================================================================
Public global variables declarations
==================================================================================================*/
const coapUriPath_t gAPP_LED_URI_PATH  = {SizeOfString(APP_LED_URI_PATH), (uint8_t *)APP_LED_URI_PATH};
const coapUriPath_t gAPP_TEMP_URI_PATH = {SizeOfString(APP_TEMP_URI_PATH), (uint8_t *)APP_TEMP_URI_PATH};
const coapUriPath_t gAPP_SINK_URI_PATH = {SizeOfString(APP_SINK_URI_PATH), (uint8_t *)APP_SINK_URI_PATH};

#if VT_KW41Z_DEMO
const coapUriPath_t gAPP_KEY_EVENT_URI_PATH = {SizeOfString(APP_KEY_EVENT_URI_PATH), APP_KEY_EVENT_URI_PATH};
const coapUriPath_t gRESET_URI_PATH  = {SizeOfString(APP_FACTORY_RESET), APP_FACTORY_RESET};
#if ACCELEROMETER_ENABLE
const coapUriPath_t gACCELEROMETER_URI_PATH  = {SizeOfString(ACCELEROMETER_URI_PATH), ACCELEROMETER_URI_PATH};
#endif
#endif /* VT_KW41Z_DEMO */

#if VT_KW41Z_MENP
#if RGB_CLICK_ENABLE
const coapUriPath_t gRGBCLICK_URI_PATH  = {SizeOfString(RGBCLICK_URI_PATH), RGBCLICK_URI_PATH};
#endif
#if RELAY_CLICK_ENABLE
const coapUriPath_t gRELAY_URI_PATH  = {SizeOfString(APP_RELAY_URI_PATH), APP_RELAY_URI_PATH};
#endif /* RELAY_CLICK_ENABLE */
#endif /* VT_KW41Z_MENP */

#if LARGE_NETWORK
const coapUriPath_t gAPP_RESET_URI_PATH = {SizeOfString(APP_RESET_TO_FACTORY_URI_PATH), (uint8_t *)APP_RESET_TO_FACTORY_URI_PATH};
#endif

/* Application state/mode */
appDeviceState_t gAppDeviceState[THR_MAX_INSTANCES];
appDeviceMode_t gAppDeviceMode[THR_MAX_INSTANCES];

/* Flag used to stop the attaching retries */
bool_t gbRetryInterrupt = TRUE;

bool_t gbCreateNetwork = FALSE;

/* CoAP instance */
uint8_t mAppCoapInstId = THR_ALL_FFs8;
/* Destination address for CoAP commands */
ipAddr_t gCoapDestAddress;

/* Application timer Id */
tmrTimerID_t mAppTimerId = gTmrInvalidTimerID_c;

#if APP_AUTOSTART
tmrTimerID_t tmrStartApp = gTmrInvalidTimerID_c;
#endif

#if VT_KW41Z_DEMO
  static int key_event_count = 0;
#endif /* VT_KW41Z_DEMO */
  
#if VT_KW41Z_MENP
  bool_t gIsOTASupported = FALSE;
#endif /* VT_KW41Z_DEMO */

uint32_t leaderLedTimestamp = 0;

/* Pointer application task message queue */
taskMsgQueue_t *mpAppThreadMsgQueue = NULL;

extern bool_t gEnable802154TxLed;

/*==================================================================================================
Public functions
==================================================================================================*/
#if (!AT_COMMAND_SHELL)

//#define TEST_EEPROM
//#define INIT_NTAG
//#define TEST_SENSORS

#define SENSOR_POLL_INTERVAL_MS		1000
#define KEYS_POLL_INTERVAL_MS		100

#define ACCELEROMETER_FXOS8700

#define ARBITER_I2C_ADDR	0x70

#define ARB_CTRL_REG	0x01
	#define LOCK_REQ	0x01
	#define LOCK_GRANT	0x02
	#define BUS_CONNECT	0x04

unsigned char NFC_INIT_DATA[] =
{
	0xAA, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00,
	0x00, 0x00, 0x00, 0x00,
	0xE1, 0x10, 0x10, 0x00
};

unsigned char NDEF_DATA[] =
{
	//NDEF URL Record
	0x03, 0x11, //NDEF message, 15 byte message
	0xD1,       // NDEF Record header: MB = 1b, ME = 1b, CF = 0b, SR = 1b, IL = 0b, TNF - 001b
	0x01, 0x0D, //type length, payload length
	0x55,       //Type = URI
	0x01,       //URI Indentifier: 1=http://www - 2=https://www - 3=http:// - 4=https://

	//Payload data = "iptronix.com"
	 'i', 'p', 't', 'r', 'o', 'n', 'i', 'x', '.', 'c', 'o', 'm',
	 0xFE,0,0,0,0,0,0,0,0,0,0,0,0
};

uint8_t ntag_init(void)
{
	uint8_t data_page[16];
    i2c_master_transfer_t masterXfer;
    uint8_t ndef_msg_blocks = (sizeof(NDEF_DATA) + 15)/16;
    int i;

    memset(&masterXfer, 0, sizeof(masterXfer));
    memset(data_page, 0, 16);

