corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
	masterXfer.slaveAddress = 0x55;
	masterXfer.direction = kI2C_Write;
	masterXfer.subaddress = 0;
	masterXfer.subaddressSize = 1;
	masterXfer.data = NFC_INIT_DATA;
	masterXfer.dataSize = 16;
	masterXfer.flags = kI2C_TransferDefaultFlag;

	OSA_TimeDelay(100);
	if(I2C_MasterTransferBlocking(I2C0, &masterXfer) != kStatus_Success)
	{
		return 0;
	}

    for (i=1; i<=ndef_msg_blocks; i++)
    {
		masterXfer.slaveAddress = 0x55;
		masterXfer.direction = kI2C_Write;
		masterXfer.subaddress = i;
		masterXfer.subaddressSize = 1;
		masterXfer.data = data_page;
		masterXfer.dataSize = 16;
		masterXfer.flags = kI2C_TransferDefaultFlag;

		OSA_TimeDelay(100);
		if(I2C_MasterTransferBlocking(I2C0, &masterXfer) != kStatus_Success)
		{
			return 0;
		}
    }

    for (i=1; i<=ndef_msg_blocks; i++)
    {
		masterXfer.slaveAddress = 0x55;
		masterXfer.direction = kI2C_Write;
		masterXfer.subaddress = i;
		masterXfer.subaddressSize = 1;
		masterXfer.data = &NDEF_DATA[16*(i-1)];
		masterXfer.dataSize = 16;
		masterXfer.flags = kI2C_TransferDefaultFlag;

		OSA_TimeDelay(100);
		if(I2C_MasterTransferBlocking(I2C0, &masterXfer) != kStatus_Success)
		{
			return 0;
		}
    }

    data_page[0] = 0xFE;
    data_page[1] = 0x01;
    data_page[2] = 0xFF;
    data_page[3] = 0x02;

	masterXfer.slaveAddress = 0x55;
	masterXfer.direction = kI2C_Write;
	masterXfer.subaddress = 0;
	masterXfer.subaddressSize = 0;
	masterXfer.data = data_page;
	masterXfer.dataSize = 4;
	masterXfer.flags = kI2C_TransferDefaultFlag;

	OSA_TimeDelay(100);
	if(I2C_MasterTransferBlocking(I2C0, &masterXfer) != kStatus_Success)
	{
		return 0;
	}

    data_page[0] = 0x3A;
    data_page[1] = 0x01;
    data_page[2] = 0xFF;
    data_page[3] = 0x02;

	masterXfer.slaveAddress = 0x55;
	masterXfer.direction = kI2C_Write;
	masterXfer.subaddress = 0;
	masterXfer.subaddressSize = 0;
	masterXfer.data = data_page;
	masterXfer.dataSize = 4;
	masterXfer.flags = kI2C_TransferDefaultFlag;

	OSA_TimeDelay(100);
	if(I2C_MasterTransferBlocking(I2C0, &masterXfer) != kStatus_Success)
	{
		return 0;
	}

	return 1;
}

uint8_t arbiter_write_register(uint8_t reg, uint8_t data)
{
    i2c_master_transfer_t masterXfer;

    memset(&masterXfer, 0, sizeof(masterXfer));

    masterXfer.slaveAddress = ARBITER_I2C_ADDR;
    masterXfer.direction = kI2C_Write;
    masterXfer.subaddress = reg;
    masterXfer.subaddressSize = 1;
    masterXfer.data = &data;
    masterXfer.dataSize = 1;
    masterXfer.flags = kI2C_TransferDefaultFlag;

    if(I2C_MasterTransferBlocking(I2C0, &masterXfer) == kStatus_Success)
    {
    	return 1;
    }

    return 0;
}

uint8_t arbiter_read_register(uint8_t reg, uint8_t* pcData)
{
    i2c_master_transfer_t masterXfer;

    memset(&masterXfer, 0, sizeof(masterXfer));

    masterXfer.slaveAddress = ARBITER_I2C_ADDR;
    masterXfer.direction = kI2C_Read;
    masterXfer.subaddress = reg;
    masterXfer.subaddressSize = 1;
    masterXfer.data = pcData;
    masterXfer.dataSize = 1;
    masterXfer.flags = kI2C_TransferDefaultFlag;

    if(I2C_MasterTransferBlocking(I2C0, &masterXfer) == kStatus_Success)
    {
    	return 1;
    }

    return 0;
}

uint8_t arbiter_get_downstream_bus(void)
{
	uint8_t ctrl_reg;

	if (!arbiter_read_register(ARB_CTRL_REG, &ctrl_reg))
	{
		return 0;
	}

	//if already connected return 1
	if ((ctrl_reg & (BUS_CONNECT | LOCK_GRANT | LOCK_REQ)) == (BUS_CONNECT | LOCK_GRANT | LOCK_REQ))
	{
		return 1;
	}

	ctrl_reg |= LOCK_REQ;
	if (!arbiter_write_register(ARB_CTRL_REG, ctrl_reg))
	{
		return 0;
	}

	do
	{
		if (!arbiter_read_register(ARB_CTRL_REG, &ctrl_reg))
		{
			return 0;
		}
	}while(!(ctrl_reg & LOCK_GRANT));

	ctrl_reg |= BUS_CONNECT;
	if (!arbiter_write_register(ARB_CTRL_REG, ctrl_reg))
	{
		return 0;
	}

	return 1;
}

uint8_t arbiter_release_downstream_bus(void)
{
	uint8_t ctrl_reg;

	if (!arbiter_read_register(ARB_CTRL_REG, &ctrl_reg))
	{
		return 0;
	}

	ctrl_reg &= ~(LOCK_REQ | BUS_CONNECT);
	if (!arbiter_write_register(ARB_CTRL_REG, ctrl_reg))
	{
		return 0;
	}

	return 1;
}

void SensorBoardInit(void)
{
    i2c_master_config_t masterConfig;
	uint8_t* peui;
    uint32_t eui_size;
    uint64_t eui_rev;

	THR_GetAttr(mThrInstanceId, gNwkAttrId_IeeeAddr_c, 0, &eui_size, &eui_rev);
	NWKU_SwapArrayBytes((uint8_t *)&eui_rev, 8);
	peui = (uint8_t *)&eui_rev;
	for (int i=0; i<eui_size; i++)
	{
		sprintf(&eui_string[2*i], "%02X", *peui);
		peui++;
	}

	BOARD_InitI2C();
    I2C_MasterGetDefaultConfig(&masterConfig);
    masterConfig.baudRate_Bps = 100000U;
    I2C_MasterInit(I2C0, &masterConfig, BOARD_GetI2cClock(0));

    if (arbiter_get_downstream_bus())
    {
    	gpio_expander_init();

#ifdef ACCELEROMETER_FXOS8700
		accelerometerInit();
#else //ACCELEROMETER_FXOS8700
		accelerometer_FXLS8972_Init();
#endif //ACCELEROMETER_FXOS8700
    	gyroscope_init();

#ifdef INIT_NTAG
    	ntag_init();
#endif //INIT_NTAG

        arbiter_release_downstream_bus();
    }

    m_bUserLedUpdate = false;
}

void SensorBoardHandle(void)
{
	static TickType_t last_sensors_ticks = 0;
	static TickType_t last_keys_ticks = 0;
	static uint8_t prev_key_status = 0;
	TickType_t now;
    char sensorsDataStr[256];
    uint16_t sensor_strlen;

#ifndef TEST_SENSORS
    if(APP_GetMode(mThrInstanceId) == gDeviceMode_Configuration_c)
    {
    	return;
    }
#endif //TEST_SENSORS

    now = xTaskGetTickCount();

    if ((now - last_sensors_ticks) >= SENSOR_POLL_INTERVAL_MS ||
    	(now - last_keys_ticks) >= KEYS_POLL_INTERVAL_MS ||
		m_bUserLedUpdate)
    {
		if (arbiter_get_downstream_bus())
		{
			if ((now - last_sensors_ticks) >= SENSOR_POLL_INTERVAL_MS)
			{
				sensorsDataStr[0] = '{';

				//Thread get eui
            	sprintf(&sensorsDataStr[1], "\"eui\":\"%s\",", eui_string);
				sensor_strlen = strlen(sensorsDataStr);
				//Read accelerometer
#ifdef ACCELEROMETER_FXOS8700
				App_GetAccDataString(&sensorsDataStr[sensor_strlen]);
#else //ACCELEROMETER_FXOS8700
				accelerometer_FXLS8972_get_data_string(&sensorsDataStr[sensor_strlen]);
#endif //ACCELEROMETER_FXOS8700
				sensor_strlen = strlen(sensorsDataStr);
				sensorsDataStr[sensor_strlen++] = ',';

				gyroscope_get_data_string(&sensorsDataStr[sensor_strlen]);
				sensor_strlen = strlen(sensorsDataStr);
				sensorsDataStr[sensor_strlen++] = ',';

				pct2075_get_temperature_string(&sensorsDataStr[sensor_strlen]);
				sensor_strlen = strlen(sensorsDataStr);
				sensorsDataStr[sensor_strlen++] = '}';
				sensorsDataStr[sensor_strlen] = 0;

				last_sensors_ticks = now;
#ifndef TEST_SENSORS
				APP_ReportSensors(sensorsDataStr);
#else //TEST_SENSORS
				//shell_printf(sensorsDataStr);
				shell_writeN(sensorsDataStr, sensor_strlen);
				shell_writeN("\n\r", 2);
#endif //TEST_SENSORS
			}

			if ((now - last_keys_ticks) >= KEYS_POLL_INTERVAL_MS)
			{
				uint8_t key_status;
				key_status = gpio_expander_get_keys();
				last_keys_ticks = now;
				if ((key_status & USR_PB1_FLAG) && prev_key_status == 0)
				{
					key_event_count++;
#ifndef TEST_SENSORS
					APP_Reportkey_event(NULL);
#else //TEST_SENSORS
					m_bUserLedUpdate = true;
#endif //TEST_SENSORS
				}
				else if ((key_status & USR_PB2_FLAG) && prev_key_status == 0)
				{
					key_event_count--;
#ifndef TEST_SENSORS
					APP_Reportkey_event(NULL);
#else //TEST_SENSORS
					m_bUserLedUpdate = true;
#endif //TEST_SENSORS
				}

