corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
				prev_key_status = key_status;
			}

			if (m_bUserLedUpdate)
			{
				m_bUserLedUpdate = false;
#ifdef TEST_SENSORS
				m_redValue = (key_event_count & 0x01)? 1 : 0;
				m_greenValue = (key_event_count & 0x02)? 1 : 0;
				m_blueValue = (key_event_count & 0x04)? 1 : 0;
#endif //TEST_SENSORS
		        /* Update RGB values */
		        gpio_expander_set_led_color(ledOff);
		        if (m_redValue)
		        {
		            gpio_expander_add_led_color(ledRed);
		        }
		        if (m_greenValue)
		        {
		            gpio_expander_add_led_color(ledGreen);
		        }
		        if (m_blueValue)
		        {
		            gpio_expander_add_led_color(ledBlue);
		        }

			}

			arbiter_release_downstream_bus();
		}
    }
}
#else //AT_COMMAND_SHELL
void APP_LedKeyboardStatusSet(eLED_KEY_USE use)
{
	m_cLedKeyboardUse = use;

	if (m_cLedKeyboardUse != atkAUTO)
	{
		LedSetATConfig(0, 0, 0);
	}
	else
	{
		App_UpdateStateLeds(APP_GetState(mThrInstanceId));
	}
}

eLED_KEY_USE APP_LedKeyboardStatusGet(void)
{
	return m_cLedKeyboardUse;
}

#endif //AT_COMMAND_SHELL

/*!*************************************************************************************************
\fn     void APP_Init(void)
\brief  This function is used to initialize application.
***************************************************************************************************/
void APP_Init
(
    void
)
{
#if VT_KW41Z_MENP
    uint8_t retStatus = ee_ok;
    uint8_t extMemInfo[EXTERNAL_MEMORY_INFORMATION_SIZE];
    uint8_t AT45DB081E_MemInfo[EXTERNAL_MEMORY_INFORMATION_SIZE] = {0x1F,0x25,0x00,0x01,0x00};
#endif /* VT_KW41Z_MENP */

#ifdef TEST_EEPROM
    uint8_t eeprom_test_data[100];
#endif //TEST_EEPROM

    /* Initialize pointer to application task message queue */
    mpAppThreadMsgQueue = &appThreadMsgQueue;

    /* Initialize main thread message queue */
    ListInit(&appThreadMsgQueue.msgQueue,APP_MSG_QUEUE_SIZE);

    /* Set default device mode/state */
    APP_SetState(gThrDefaultInstanceId_c, gDeviceState_FactoryDefault_c);
    APP_SetMode(gThrDefaultInstanceId_c, gDeviceMode_Configuration_c);

    /* Initialize keyboard handler */
    pfAppKeyboardHandler = App_HandleKeyboard;

    /* Use one instance ID for application */
    mThrInstanceId = gThrDefaultInstanceId_c;

#if THR_ENABLE_EVENT_MONITORING
    /* Initialize event monitoring */
    APP_InitEventMonitor(mThrInstanceId);
#endif

#ifdef TEST_EEPROM
    EEPROM_Init();
    if (EEPROM_ReadData(100, 0x1234, eeprom_test_data) == ee_ok)
    {
    	for (int i=0; i<100; i++)
    	{
    		eeprom_test_data[i] = 99-i;
    	}

    	if (EEPROM_WriteData(100, 0x1234, eeprom_test_data) == ee_ok)
    	{
        	for (int i=0; i<100; i++)
        	{
        		eeprom_test_data[i] = 0;
        	}

        	EEPROM_ReadData(100, 0x1234, eeprom_test_data);
    	}
    }

#endif //TEST_EEPROM

#if VT_KW41Z_MENP
    #if RGB_CLICK_ENABLE
       RGBLed_Init();
    #endif /* RGB_CLICK_ENABLE */
    #if RELAY_CLICK_ENABLE
            Relay_Init();
            Led1On();
    #endif /* RELAY_CLICK_ENABLE */
#endif /* VT_KW41Z_MENP */

    if(gThrStatus_Success_c == THR_StartInstance(mThrInstanceId, pStackCfg[0]))
    {
        /* Initialize CoAP demo */
        APP_InitCoapDemo();

#if USE_TEMPERATURE_SENSOR
        /* Initialize Temperature sensor/ADC module*/
        APP_InitADC(ADC_0);
#endif

#if THREAD_USE_THCI && THR_ENABLE_MGMT_DIAGNOSTICS
        (void)MgmtDiagnostic_RegisterAppCb(THCI_MgmtDiagnosticAppCb);
#endif

#if THREAD_USE_SHELL && SOCK_DEMO
        /* Initialize use sockets - used from shell */
        APP_InitUserSockets(mpAppThreadMsgQueue);
#endif
     
     /* Display current firmware version */
     currentVersion.versionValue = gOtaCurrentFileVersionNo_c;
#if (!AT_COMMAND_SHELL)
     shell_printf("Thread end node firmware version: %x.%x.%x\r\n", (currentVersion.versionByte[MAJOR_FW_VERSION_BYTE] >> 4 & 0x0F),
                                                                    (currentVersion.versionByte[MAJOR_FW_VERSION_BYTE] & 0x0F),
                                                                    (currentVersion.versionByte[MINOR_FW_VERSION_BYTE]));
#endif //AT_COMMAND_SHELL
#if VT_KW41Z_MENP
    /* Check for the External memory availability */
    retStatus = EEPROM_Init();
    if(retStatus != ee_ok)
    {
      shell_printf("Failed to init the external memory\r\n");
      shell_printf("Disabling the OTA support\r\n");
      gIsOTASupported = FALSE;
    }
    else
    {
      /* Now read External memory Id for the verification */
      memset(extMemInfo,0x00,EXTERNAL_MEMORY_INFORMATION_SIZE);
      EEPROM_ReadBasicInfo(extMemInfo);
      if(memcmp(extMemInfo,AT45DB081E_MemInfo,EXTERNAL_MEMORY_INFORMATION_SIZE) == 0)
      {
        shell_printf("Thread end node supports OTA\r\n");
        gIsOTASupported = TRUE;
      }
      else
      {
        shell_printf("Thread end node does not supports OTA\r\n");
        gIsOTASupported = FALSE;
      }
    }

if(gIsOTASupported && gEnableOTAClient_d)
{
  OtaClientInit(mThrInstanceId, mpAppThreadMsgQueue);
}
#else
#if gEnableOTAClient_d
        OtaClientInit(mThrInstanceId, mpAppThreadMsgQueue);
#endif /* gEnableOTAClient_d */
#endif /* VT_KW41Z_MENP */

#if NTAG_I2C && VT_KW41Z_MENP
  InitNTAG();   //init I2C NTAG
  WriteTag();        
#endif

#if APP_AUTOSTART
        tmrStartApp = TMR_AllocateTimer();

        if(tmrStartApp != gTmrInvalidTimerID_c)
        {
            uint32_t jitterTime = NWKU_GetRandomNoFromInterval(gAppFactoryResetTimeoutMin_c,
                                                               gAppFactoryResetTimeoutMax_c);
            TMR_StartSingleShotTimer(tmrStartApp, jitterTime, APP_AutoStartCb, NULL);
        }
#endif

    }

#if (!AT_COMMAND_SHELL)
    SensorBoardInit();
#endif //AT_COMMAND_SHELL
}

/*!*************************************************************************************************
\fn     void App_Handler(void)
\brief  Application Handler. In this configuration is called on the task with the lowest priority
***************************************************************************************************/
void APP_Handler
(
    void
)
{
    bool_t handleMsg = TRUE;

#if (!AT_COMMAND_SHELL)
    SensorBoardHandle();
#endif //AT_COMMAND_SHELL

    while(handleMsg == TRUE)
    {
        handleMsg = NWKU_MsgHandler(&appThreadMsgQueue);
        /* For BareMetal break the while(1) after 1 run */
        if(!gUseRtos_c && MSG_Pending(&appThreadMsgQueue.msgQueue))
        {
            (void)OSA_EventSet(appThreadMsgQueue.taskEventId, NWKU_GENERIC_MSG_EVENT);
            break;
        }

