corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
/*!*************************************************************************************************
\fn     void App_RestoreLeaderLedCb(void *param)
\brief  Called in Application state to restore leader LED.

\param  [in]    param    Not used
***************************************************************************************************/
void App_RestoreLeaderLedCb
(
    void *param
)
{
    (void)NWKU_SendMsg(App_RestoreLeaderLed, NULL, mpAppThreadMsgQueue);
}

/*==================================================================================================
Private functions
==================================================================================================*/
#if (AT_COMMAND_SHELL)
extern void SHELL_InitUserURI(void);
#endif //AT_COMMAND_SHELL

/*!*************************************************************************************************
\private
\fn     static void APP_InitCoapDemo(void)
\brief  Initialize CoAP demo.
***************************************************************************************************/
static void APP_InitCoapDemo
(
    void
)
{
    coapRegCbParams_t cbParams[] =  {{APP_CoapLedCb,  (coapUriPath_t *)&gAPP_LED_URI_PATH},
                                     {APP_CoapTempCb, (coapUriPath_t *)&gAPP_TEMP_URI_PATH},

#if VT_KW41Z_DEMO
                                    {APP_CoapkeyeventCb,(coapUriPath_t*)&gAPP_KEY_EVENT_URI_PATH},
                                    {APP_CoapresetCb,  (coapUriPath_t*)&gRESET_URI_PATH},
                                    {Accelerometer_CoapCb,  (coapUriPath_t*)&gACCELEROMETER_URI_PATH},
#endif /* VT_KW41Z_DEMO */

#if VT_KW41Z_MENP
#if RGB_CLICK_ENABLE                                    
                                    {APP_CoapRGBCb,  (coapUriPath_t*)&gRGBCLICK_URI_PATH},
#endif /* RGB_CLICK_ENABLE */
#if RELAY_CLICK_ENABLE                                    
                                    {APP_CoapRelayCb,  (coapUriPath_t*)&gRELAY_URI_PATH},
#endif /* RELAY_CLICK_ENABLE */
#endif /* VT_KW41Z_MENP */

#if LARGE_NETWORK
                                     {APP_CoapResetToFactoryDefaultsCb, (coapUriPath_t *)&gAPP_RESET_URI_PATH},
#endif
                                     {APP_CoapSinkCb, (coapUriPath_t *)&gAPP_SINK_URI_PATH}};
    /* Register Services in COAP */
    coapStartUnsecParams_t coapParams = {COAP_DEFAULT_PORT, AF_INET6};
    mAppCoapInstId = COAP_CreateInstance(NULL, &coapParams, gIpIfSlp0_c, (coapRegCbParams_t *)cbParams,
                                         NumberOfElements(cbParams));
#if (AT_COMMAND_SHELL)
    SHELL_InitUserURI();
#endif //AT_COMMAND_SHELL
}

/*!*************************************************************************************************
\private
\fn     static void APP_ThrNwkJoin(void *param)
\brief  Start the joining procedure.

\param  [in]    param    Not used
***************************************************************************************************/
static void APP_ThrNwkJoin
(
    void *param
)
{
    if(THR_NwkJoin(mThrInstanceId, THR_APP_JOIN_DISCOVERY_METHOD) != gThrStatus_Success_c)
    {
        /* User can treat join failure according to their application */
    }
}

/*!*************************************************************************************************
\private
\fn     static void App_JoinTimerCallback(void *param)
\brief  Join timer callback.

\param  [in]    param    Not used
***************************************************************************************************/
static void App_JoinTimerCallback
(
    void *param
)
{
    if(mFirstPushButtonPressed)
    {
        mJoiningIsAppInitiated = TRUE;
        TMR_FreeTimer(mAppTimerId);
        mAppTimerId = gTmrInvalidTimerID_c;
        (void)NWKU_SendMsg(APP_ThrNwkJoin, NULL, mpAppThreadMsgQueue);
    }
}

/*!*************************************************************************************************
\private
\fn     static void APP_ConfigModeSwShortPressHandler(uint32_t keyEvent)
\brief  This is a handler for  KBD module - short press events. Device is in configuration mode.

\param  [in]    keyEvent    The keyboard module event
***************************************************************************************************/
static void APP_ConfigModeSwShortPressHandler
(
    uint32_t keyEvent
)
{
    (void)keyEvent;

    if((APP_GetState(mThrInstanceId) == gDeviceState_FactoryDefault_c) ||
       (APP_GetState(mThrInstanceId) == gDeviceState_NwkFailure_c) ||
       (APP_GetState(mThrInstanceId) == gDeviceState_NwkOperationPending_c))
    {
        App_UpdateStateLeds(gDeviceState_JoiningOrAttaching_c);
        mFirstPushButtonPressed = TRUE;

        if(mAppTimerId == gTmrInvalidTimerID_c)
        {
            mAppTimerId = TMR_AllocateTimer();
        }

        /* Validate application timer Id */
        if(mAppTimerId != gTmrInvalidTimerID_c)
        {
            /* Start the application timer. Wait gAppJoinTimeout_c
               to start the joining procedure */
            TMR_StartSingleShotTimer(mAppTimerId, gAppJoinTimeout_c, App_JoinTimerCallback, NULL);
        }
        else
        {
            mJoiningIsAppInitiated = TRUE;
            /* No timer available - try to join the network */
            if(THR_NwkJoin(mThrInstanceId, THR_APP_JOIN_DISCOVERY_METHOD) != gThrStatus_Success_c)
            {
                /* User can treat join failure according to their application */
            }
        }
    }
    /* Double press */
    else if(mFirstPushButtonPressed)
    {
#ifndef VT_KW41Z_MENP
        /* Reset */
        mFirstPushButtonPressed = FALSE;

        if((mJoiningIsAppInitiated == FALSE) &&
           (!THR_GetAttr_IsDevConnected(mThrInstanceId)))
        {
            if(mAppTimerId != gTmrInvalidTimerID_c)
            {
                TMR_FreeTimer(mAppTimerId);
                mAppTimerId = gTmrInvalidTimerID_c;
            }

            App_UpdateStateLeds(gDeviceState_Leader_c);
            /* Create the network */
            (void)THR_NwkCreate(mThrInstanceId);
        }
        else
        {
            /* Create network */
            gbCreateNetwork = TRUE;
            /* Device will create the network after receiving the next gThrEv_NwkJoinCnf_Failed_c event */
        }
#endif /* VT_KW41Z_MENP */
    }
}

