corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
/*!*************************************************************************************************
\private
\fn     static void APP_ConfigModeHandleKeyboard(uint32_t keyEvent)
\brief  This is a handler for KBD module events. Device is in configuration mode.

\param  [in]    keyEvent   The keyboard module event
***************************************************************************************************/
static void APP_ConfigModeHandleKeyboard
(
    uint32_t keyEvent
)
{
    switch(keyEvent)
    {
        case gKBD_EventPB1_c:
#if gKBD_KeysCount_c > 1
        case gKBD_EventPB2_c:
        case gKBD_EventPB3_c:
        case gKBD_EventPB4_c:
#endif
            APP_ConfigModeSwShortPressHandler(keyEvent);
            break;
        case gKBD_EventLongPB1_c:
#if gKBD_KeysCount_c > 1
        case gKBD_EventLongPB2_c:
        case gKBD_EventLongPB3_c:
        case gKBD_EventLongPB4_c:
#endif
            break;
        case gKBD_EventVeryLongPB1_c:
#if gKBD_KeysCount_c > 1
        case gKBD_EventVeryLongPB2_c:
        case gKBD_EventVeryLongPB3_c:
        case gKBD_EventVeryLongPB4_c:
#endif
            /* Factory reset */
            THR_FactoryReset();
            break;
        default:
            break;
    }
}

/*!*************************************************************************************************
\private
\fn     static void APP_AppModeHandleKeyboard(uint32_t keyEvent)
\brief  This is a handler for KBD module events. Device is in application mode.

\param  [in]    keyEvent   The keyboard module event
***************************************************************************************************/
static void APP_AppModeHandleKeyboard
(
    uint32_t keyEvent
)
{
    switch(keyEvent)
    {
        case gKBD_EventPB1_c:
#if VT_KW41Z_MENP
             /* Report key event */
            (void)NWKU_SendMsg(APP_Reportkey_event, NULL, mpAppThreadMsgQueue);
#else
#ifdef FRDM_KW41Z
            /* Remote led RGB - on */
            //(void)NWKU_SendMsg(APP_SendLedRgbOn, NULL, mpAppThreadMsgQueue);
            (void)NWKU_SendMsg(APP_TestCoapMsg, NULL, mpAppThreadMsgQueue);
#else
            /* Data sink create */
            (void)NWKU_SendMsg(APP_SendDataSinkCreate, NULL, mpAppThreadMsgQueue);
#endif
#endif /* VT_KW41Z_MENP */ 
            break;
#if gKBD_KeysCount_c > 1
        case gKBD_EventPB2_c:
#if VT_KW41Z_DEMO
            (void)NWKU_SendMsg(APP_Reportkey_event, NULL, mpAppThreadMsgQueue);
#else
#ifdef FRDM_KW41Z
            /* Remote led RGB - off */
            (void)NWKU_SendMsg(APP_SendLedRgbOff, NULL, mpAppThreadMsgQueue);
#else
            /* Report temperature */
            (void)NWKU_SendMsg(APP_ReportTemp, NULL, mpAppThreadMsgQueue);
#endif
#endif /* VT_KW41Z_DEMO */ 
            break;
        case gKBD_EventPB3_c:
            /* Remote led RGB - on */
            (void)NWKU_SendMsg(APP_SendLedRgbOn, NULL, mpAppThreadMsgQueue);
            break;
        case gKBD_EventPB4_c:
            /* Remote led RGB - off */
            (void)NWKU_SendMsg(APP_SendLedRgbOff, NULL, mpAppThreadMsgQueue);
            break;
#endif
        case gKBD_EventLongPB1_c:
#ifdef FRDM_KW41Z
            /* Report temperature */
            (void)NWKU_SendMsg(APP_ReportTemp, NULL, mpAppThreadMsgQueue);
#else
            /* Remote data sink release */
            (void)NWKU_SendMsg(APP_SendDataSinkRelease, NULL, mpAppThreadMsgQueue);
#endif
            break;
#if gKBD_KeysCount_c > 1
        case gKBD_EventLongPB2_c:
#ifdef FRDM_KW41Z
            /* Remote led flash */
            (void)NWKU_SendMsg(APP_SendLedFlash, NULL, mpAppThreadMsgQueue);
            break;
#else
            /* Local data sink release */
            (void)NWKU_SendMsg(APP_LocalDataSinkRelease, NULL, mpAppThreadMsgQueue);
#endif
            break;
        case gKBD_EventLongPB3_c:
            /* Remote led flash */
            (void)NWKU_SendMsg(APP_SendLedFlash, NULL, mpAppThreadMsgQueue);
            break;
        case gKBD_EventLongPB4_c:
            /* Remote led - color wheel */
            (void)NWKU_SendMsg(APP_SendLedColorWheel, NULL, mpAppThreadMsgQueue);
            break;
#endif
        case gKBD_EventVeryLongPB1_c:
            /* Factory reset,  not for FRDM_KW24D512*/
#ifdef FRDM_KW24
            OtaClient_StartServerDiscovery(NULL);
            break;
#endif
#if gKBD_KeysCount_c > 1
        case gKBD_EventVeryLongPB4_c:
#if LARGE_NETWORK
            /* OTA factory reset */
            (void)NWKU_SendMsg(APP_SendResetToFactoryCommand, NULL, mpAppThreadMsgQueue);
            break;
#endif
        case gKBD_EventVeryLongPB3_c:
        case gKBD_EventVeryLongPB2_c:
#endif
            /* Factory reset */
            THR_FactoryReset();
            break;
        default:
            break;
    }
}

/*!*************************************************************************************************
\private
\fn     static void App_HandleKeyboard(void *param)
\brief  This is a handler for KBD module events.

\param  [in]    param    The keyboard module event
***************************************************************************************************/
static void App_HandleKeyboard
(
    void *param
)
{
    uint32_t events = (uint32_t)(param);

#if (AT_COMMAND_SHELL)
    if (m_cLedKeyboardUse == atkAUTO)
    {
#endif //AT_COMMAND_SHELL
		if(APP_GetMode(mThrInstanceId) == gDeviceMode_Configuration_c)
		{
			/* Device is in configuration mode */
			APP_ConfigModeHandleKeyboard(events);
		}
		else
		{
			/* Device is in application mode */
			APP_AppModeHandleKeyboard(events);
		}
#if (AT_COMMAND_SHELL)
    }
    else if (m_cLedKeyboardUse == atkAT_ASYNC)
    {
    	//Send AT asynchronous message
        shell_printf("\r+WIND:keyboard event = %d\n\r", events);
    }
#endif //AT_COMMAND_SHELL
}

/*!*************************************************************************************************
\private
\fn     static void App_UpdateLedState(appDeviceState_t deviceState)
\brief  Called when Application state and LEDs must be updated.

\param  [in]    deviceState    The current device state
***************************************************************************************************/
static void App_UpdateStateLeds
(
    appDeviceState_t deviceState
)
{
    /* If the user presses a button different than the LED off button, reset timestamp */
    if((gpaThrAttr[mThrInstanceId]->devRole == gThrDevRole_Leader_c) &&
       (APP_GetState(mThrInstanceId) != gDeviceState_AppLedOff_c) &&
       (leaderLedTimestamp != 0))
    {
        leaderLedTimestamp = 0;
    }

