corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
    APP_SetState(mThrInstanceId, deviceState);

#if VT_KW41Z_MENP
#ifndef RELAY_CLICK_ENABLE
    if(deviceState != gDeviceState_ActiveRouter_c)
    {
      Led_SetState(APP_GetMode(mThrInstanceId), APP_GetState(mThrInstanceId));
    }
#else
    if(deviceState == gDeviceState_NwkConnected_c)
    {
      Led1Off();
    }
#endif /* RELAY_CLICK_ENABLE */
#else
		Led_SetState(APP_GetMode(mThrInstanceId), APP_GetState(mThrInstanceId));
#endif /* VT_KW41Z_MENP */
}

/*!*************************************************************************************************
\private
\fn     static void APP_JoinEventsHandler(thrEvCode_t evCode)
\brief  This function is used to the handle join failed event.

\param  [in]    evCode    Event code
***************************************************************************************************/
static void APP_JoinEventsHandler
(
    thrEvCode_t evCode
)
{
    if(mJoiningIsAppInitiated)
    {
        if(evCode == gThrEv_NwkJoinCnf_Failed_c)
        {
            if(gbRetryInterrupt && !gbCreateNetwork)
            {
                mJoiningIsAppInitiated = TRUE;

                /* Retry to join the network */
                if(THR_NwkJoin(mThrInstanceId, THR_APP_JOIN_DISCOVERY_METHOD) != gThrStatus_Success_c)
                {
                    /* User can treat join failure according to their application */
                }
                return;
            }
            else if(gbCreateNetwork)
            {
#if VT_KW41Z_MENP
                 /* Reset the module */
	         THR_FactoryReset();
#else
                /* Create the network */
                (void)THR_NwkCreate(mThrInstanceId);
#endif /* VT_KW41Z_MENP */
            }
            mJoiningIsAppInitiated = FALSE;
        }
        else if(evCode == gThrEv_NwkJoinCnf_Success_c)
        {
            mJoiningIsAppInitiated = FALSE;
        }
    }
}

/*==================================================================================================
  Coap Demo functions:
==================================================================================================*/
/*!*************************************************************************************************
\private
\fn     static void APP_CoapGenericCallback(coapSessionStatus_t sessionStatus, void *pData,
                                            coapSession_t *pSession, uint32_t dataLen)
\brief  This function is the generic callback function for CoAP message.

\param  [in]    sessionStatus   Status for CoAP session
\param  [in]    pData           Pointer to CoAP message payload
\param  [in]    pSession        Pointer to CoAP session
\param  [in]    dataLen         Length of CoAP payload
***************************************************************************************************/
static void APP_CoapGenericCallback
(
    coapSessionStatus_t sessionStatus,
    void *pData,
    coapSession_t *pSession,
    uint32_t dataLen
)
{
    /* If no ACK was received, try again */
    if(sessionStatus == gCoapFailure_c)
    {
        if(FLib_MemCmp(pSession->pUriPath->pUriPath, (coapUriPath_t *)&gAPP_TEMP_URI_PATH.pUriPath,
                       pSession->pUriPath->length))
        {
            (void)NWKU_SendMsg(APP_ReportTemp, NULL, mpAppThreadMsgQueue);
        }
    }
    /* Process data, if any */
}

/*!*************************************************************************************************
\private
\fn     static void APP_ReportTemp(void *pParam)
\brief  This open a socket and report the temperature to gCoapDestAddress.

\param  [in]    pParam    Not used
***************************************************************************************************/
static void APP_ReportTemp
(
    void *pParam
)
{
    coapSession_t *pSession = NULL;
    /* Get Temperature */
    uint8_t *pTempString = App_GetTempDataString();
    uint32_t ackPloadSize;
    ifHandle_t ifHandle = THR_GetIpIfPtrByInstId(mThrInstanceId);

    if(!IP_IF_IsMyAddr(ifHandle->ifUniqueId, &gCoapDestAddress))
    {
        pSession = COAP_OpenSession(mAppCoapInstId);

        if(NULL != pSession)
        {
            coapMsgTypesAndCodes_t coapMessageType = gCoapMsgTypeNonPost_c;

            pSession->pCallback = NULL;
            FLib_MemCpy(&pSession->remoteAddr, &gCoapDestAddress, sizeof(ipAddr_t));
            ackPloadSize = strlen((char *)pTempString);
            COAP_SetUriPath(pSession, (coapUriPath_t *)&gAPP_TEMP_URI_PATH);

            if(!IP6_IsMulticastAddr(&gCoapDestAddress))
            {
                coapMessageType = gCoapMsgTypeConPost_c;
                pSession->pCallback = APP_CoapGenericCallback;
            }

            COAP_Send(pSession, coapMessageType, pTempString, ackPloadSize);
        }
    }
    /* Print temperature in shell */
    shell_write("\r");
    shell_write((char *)pTempString);
    shell_refresh();
    MEM_BufferFree(pTempString);
}

#if VT_KW41Z_DEMO
/*!*************************************************************************************************
\private
\fn     void APP_Reportkey_event(void *pParam)
\brief  This open a socket and report the temperature to gAppRemoteAddress.

\param  [in]    pParam   pointer to stack event

\return         void
***************************************************************************************************/
static void APP_Reportkey_event(void *pParam)
{

    coapSession_t *pSession = NULL;
    uint8_t *pKeyCount;
    uint32_t ackPloadSize;
    char data_buffer[80];
    ipAddr_t pDestAddr;
    pSession = COAP_OpenSession(mAppCoapInstId);
    
    if (NULL != pSession)
    {
        memset(data_buffer,0,80);
        coapMsgTypesAndCodes_t coapMessageType = gCoapMsgTypeNonPost_c;
        
        pDestAddr.addr8[0]=0xFD;
        pDestAddr.addr8[1]=0x01;
        pDestAddr.addr8[2]=0x00;
        pDestAddr.addr8[3]=0x00;
        pDestAddr.addr8[4]=0x00;
        pDestAddr.addr8[5]=0x00;
        pDestAddr.addr8[6]=0x00;
        pDestAddr.addr8[7]=0x00;
        pDestAddr.addr8[8]=0x00;
        pDestAddr.addr8[9]=0x00;
        pDestAddr.addr8[10]=0x00;
        pDestAddr.addr8[11]=0x00;
        pDestAddr.addr8[12]=0x00;
        pDestAddr.addr8[13]=0x00;
        pDestAddr.addr8[14]=0x00;
        pDestAddr.addr8[15]=0x02;
        
        //pSession->pIfHandle = THR_GetIpIfByInstId(mThrInstanceId);
        pSession->pCallback = NULL;
        FLib_MemCpy(&pSession->remoteAddr, &pDestAddr, sizeof(ipAddr_t));
        /* Get Temperature */
        //key_event_count++;
        sprintf(data_buffer,"{\"eui\":\"%s\",\"key_count\":\"%d\"}",eui_string, key_event_count);
        pKeyCount = (unsigned char *)data_buffer;

        ackPloadSize = strlen((char*)pKeyCount);
        //COAP_AddOptionToList(pSession,COAP_URI_PATH_OPTION, APP_KEY_EVENT_URI_PATH, SizeOfString(APP_KEY_EVENT_URI_PATH));

        /*if(!IP6_IsMulticastAddr(&gCoapDestAddress))
        {
            coapMessageType = gCoapMsgTypeConPost_c;
            pSession->pCallback = APP_CoapGenericCallback;
        }*/

