corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
        COAP_Send(pSession, coapMessageType, pKeyCount, ackPloadSize);

    }
}

static void APP_ReportSensors(char* pSensorString)
{
    coapSession_t *pSession = NULL;
    uint32_t ackPloadSize;
    ipAddr_t pDestAddr;
    pSession = COAP_OpenSession(mAppCoapInstId);

    if (NULL != pSession)
    {
        coapMsgTypesAndCodes_t coapMessageType = gCoapMsgTypeNonPost_c;

        pDestAddr.addr8[0]=0xFD;
        pDestAddr.addr8[1]=0x01;
        pDestAddr.addr8[2]=0x00;
        pDestAddr.addr8[3]=0x00;
        pDestAddr.addr8[4]=0x00;
        pDestAddr.addr8[5]=0x00;
        pDestAddr.addr8[6]=0x00;
        pDestAddr.addr8[7]=0x00;
        pDestAddr.addr8[8]=0x00;
        pDestAddr.addr8[9]=0x00;
        pDestAddr.addr8[10]=0x00;
        pDestAddr.addr8[11]=0x00;
        pDestAddr.addr8[12]=0x00;
        pDestAddr.addr8[13]=0x00;
        pDestAddr.addr8[14]=0x00;
        pDestAddr.addr8[15]=0x02;

        //pSession->pIfHandle = THR_GetIpIfByInstId(mThrInstanceId);
        pSession->pCallback = NULL;
        FLib_MemCpy(&pSession->remoteAddr, &pDestAddr, sizeof(ipAddr_t));

        ackPloadSize = strlen(pSensorString);
        //COAP_AddOptionToList(pSession,COAP_URI_PATH_OPTION, APP_KEY_EVENT_URI_PATH, SizeOfString(APP_KEY_EVENT_URI_PATH));

        /*if(!IP6_IsMulticastAddr(&gCoapDestAddress))
        {
            coapMessageType = gCoapMsgTypeConPost_c;
            pSession->pCallback = APP_CoapGenericCallback;
        }*/

        COAP_Send(pSession, coapMessageType, pSensorString, ackPloadSize);
    }
}

#endif /* VT_KW41Z_DEMO */

static void APP_TestCoapMsg(void *pParam)
{

    coapSession_t *pSession = NULL;
    uint32_t ackPloadSize;
    char data_buffer[32];
    ipAddr_t pDestAddr;
    pSession = COAP_OpenSession(mAppCoapInstId);

    if (NULL != pSession)
    {
        memset(data_buffer,0,32);
        coapMsgTypesAndCodes_t coapMessageType = gCoapMsgTypeNonPost_c;

        pDestAddr.addr8[0]=0xFD;
        pDestAddr.addr8[1]=0x01;
        pDestAddr.addr8[2]=0x00;
        pDestAddr.addr8[3]=0x00;
        pDestAddr.addr8[4]=0x00;
        pDestAddr.addr8[5]=0x00;
        pDestAddr.addr8[6]=0x00;
        pDestAddr.addr8[7]=0x00;
        pDestAddr.addr8[8]=0x00;
        pDestAddr.addr8[9]=0x00;
        pDestAddr.addr8[10]=0x00;
        pDestAddr.addr8[11]=0x00;
        pDestAddr.addr8[12]=0x00;
        pDestAddr.addr8[13]=0x00;
        pDestAddr.addr8[14]=0x00;
        pDestAddr.addr8[15]=0x02;

        //pSession->pIfHandle = THR_GetIpIfByInstId(mThrInstanceId);
        pSession->pCallback = NULL;
        FLib_MemCpy(&pSession->remoteAddr, &pDestAddr, sizeof(ipAddr_t));
        sprintf(data_buffer,"ciao pippo");

        ackPloadSize = strlen((char*)data_buffer);
        COAP_AddOptionToList(pSession,COAP_URI_PATH_OPTION, (uint8_t*)"/testcoap", SizeOfString("/testcoap"));

        /*if(!IP6_IsMulticastAddr(&gCoapDestAddress))
        {
            coapMessageType = gCoapMsgTypeConPost_c;
            pSession->pCallback = APP_CoapGenericCallback;
        }*/

        COAP_Send(pSession, coapMessageType, data_buffer, ackPloadSize);

    }
}

#ifndef FRDM_KW41Z
/*!*************************************************************************************************
\private
\fn     static nwkStatus_t APP_SendDataSinkCommand(uint8_t *pCommand, uint8_t dataLen)
\brief  This function is used to send a Data Sink command to APP_DEFAULT_DEST_ADDR.

\param  [in]    pCommand       Pointer to command data
\param  [in]    dataLen        Data length

\return         nwkStatus_t    Status of the command
***************************************************************************************************/
static nwkStatus_t APP_SendDataSinkCommand
(
    uint8_t *pCommand,
    uint8_t dataLen
)
{
    nwkStatus_t status = gNwkStatusFail_c;
    coapSession_t *pSession = COAP_OpenSession(mAppCoapInstId);

    if(pSession)
    {
        ipAddr_t coapDestAddress = APP_DEFAULT_DEST_ADDR;

        pSession->pCallback = NULL;
        FLib_MemCpy(&pSession->remoteAddr, &coapDestAddress, sizeof(ipAddr_t));
        COAP_SetUriPath(pSession, (coapUriPath_t *)&gAPP_SINK_URI_PATH);
        status = COAP_Send(pSession, gCoapMsgTypeNonPost_c, pCommand, dataLen);
    }

    return status;
}

/*!*************************************************************************************************
\private
\fn     static void APP_SendDataSinkCreate(void *pParam)
\brief  This function is used to send a Data Sink Create command to APP_DEFAULT_DEST_ADDR.

\param  [in]    pParam    Not used
***************************************************************************************************/
static void APP_SendDataSinkCreate
(
    void *pParam
)
{
    uint8_t aCommand[] = {"create"};

    /* Send command over the air */
    if(APP_SendDataSinkCommand(aCommand, sizeof(aCommand)) == gNwkStatusSuccess_c)
    {
        /* Local data sink create */
        (void)THR_GetIP6Addr(mThrInstanceId, gMLEIDAddr_c, &gCoapDestAddress, NULL);
    }
}

/*!*************************************************************************************************
\private
\fn     static void APP_SendDataSinkRelease(void *pParam)
\brief  This function is used to send a Data Sink Release command to APP_DEFAULT_DEST_ADDR.

\param  [in]    pParam    Not used
***************************************************************************************************/
static void APP_SendDataSinkRelease
(
    void *pParam
)
{
    uint8_t aCommand[] = {"release"};

    /* Send command over the air */
    if(APP_SendDataSinkCommand(aCommand, sizeof(aCommand)) == gNwkStatusSuccess_c)
    {
        /* Local data sink release */
        APP_LocalDataSinkRelease(pParam);
    }
}
#endif

#if !(VT_KW41Z_MENP)
/*!*************************************************************************************************
\private
\fn     static void APP_SendLedCommand(uint8_t *pCommand, uint8_t dataLen)
\brief  This function is used to send a Led command to gCoapDestAddress.

\param  [in]    pCommand    Pointer to command data
\param  [in]    dataLen     Data length
***************************************************************************************************/
static void APP_SendLedCommand
(
    uint8_t *pCommand,
    uint8_t dataLen
)
{
    ifHandle_t ifHandle = THR_GetIpIfPtrByInstId(mThrInstanceId);

    if(!IP_IF_IsMyAddr(ifHandle->ifUniqueId, &gCoapDestAddress))
    {
        coapSession_t *pSession = COAP_OpenSession(mAppCoapInstId);

        if(pSession)
        {
            coapMsgTypesAndCodes_t coapMessageType = gCoapMsgTypeNonPost_c;

            pSession->pCallback = NULL;
            FLib_MemCpy(&pSession->remoteAddr, &gCoapDestAddress, sizeof(ipAddr_t));
            COAP_SetUriPath(pSession,(coapUriPath_t *)&gAPP_LED_URI_PATH);

            if(!IP6_IsMulticastAddr(&gCoapDestAddress))
            {
                coapMessageType = gCoapMsgTypeConPost_c;
                pSession->pCallback = APP_CoapGenericCallback;
            }
            else
            {
                APP_ProcessLedCmd(pCommand, dataLen);
            }
            COAP_Send(pSession, coapMessageType, pCommand, dataLen);
        }
    }
    else
    {
        APP_ProcessLedCmd(pCommand, dataLen);
    }
}

