corewithharry/asme-tiger-kw41/Tiger-KW41Z-DemoApp/source/router_eligible_device_app_ota_client.c
        dataLen -= strlen("rgb");

        while(dataLen != 0)
        {
            if(*p == 'r')
            {
                p++;
                dataLen--;
                redValue = NWKU_atoi(p);
            }

            if(*p == 'g')
            {
                p++;
                dataLen--;
                greenValue = NWKU_atoi(p);
            }

            if(*p == 'b')
            {
                p++;
                dataLen--;
                blueValue = NWKU_atoi(p);
            }

            dataLen--;
            p++;
        }

        /* Update RGB values */
#if gLedRgbEnabled_d
        Led_UpdateRgbState(redValue, greenValue, blueValue);
#else
        appState = gDeviceState_AppLedOff_c;

        if(redValue || greenValue || blueValue)
        {
            appState = gDeviceState_AppLedOn_c;
        }
#endif
        App_UpdateStateLeds(appState);

        /* If device is leader and has received a RGB LED off command and there were no previous button presses */
        if((gpaThrAttr[mThrInstanceId]->devRole == gThrDevRole_Leader_c) &&
           (!redValue && !greenValue && !blueValue) && (leaderLedTimestamp == 0))
        {
            leaderLedTimestamp = (TMR_GetTimestamp()/1000000) + gAppRestoreLeaderLedTimeout_c;
        }
    }
    else if(FLib_MemCmp(pCommand, "color wheel", 11))
    {
#if gLedRgbEnabled_d
        App_UpdateStateLeds(gDeviceState_AppLedColorWheel_c);
#else
        App_UpdateStateLeds(gDeviceState_AppLedFlash_c);
#endif
    }
#else //0
	char *p;
	uint8_t phase;	//0: '{'; 1: field; 2: ':'; 3: value
    uint8_t redValue = 0, greenValue = 0, blueValue = 0;
    uint8_t* pField;

    /* Set mode state */
    APP_SetMode(mThrInstanceId, gDeviceMode_Application_c);

    p = (char*)pCommand;
    phase = 0;

	m_bUserLedUpdate = false;

    while(dataLen > 0 && *p != '}')
    {
    	if (*p == ' ' || *p=='"')
    	{
    		p++;
    		dataLen--;
    		continue;
    	}

    	switch(phase)
    	{
    		case 0:
    			if (*p == '{')
    			{
    				phase = 1;
    			}
    			else
    			{
    				return;
    			}
    			break;

    		case 1:
    			if (*p == 'r')
    			{
    				pField = &redValue;
    				phase = 2;
    			}
    			else if (*p == 'g')
    			{
    				pField = &greenValue;
    				phase = 2;
    			}
    			else if (*p == 'b')
    			{
    				pField = &blueValue;
    				phase = 2;
    			}
    			else
    			{
    				return;
    			}
    			break;

    		case 2:
    			if (*p == ':')
    			{
    				phase = 3;
    			}
    			else
    			{
    				return;
    			}
    			break;

    		case 3:
    			if (*p >= '0' && *p <= '9')
    			{
    				*pField = (*pField)*10 + (*p - '0');
    			}
    			else if (*p == ',')
    			{
    				phase = 1;
    			}
    			else
    			{
    				return;
    			}
    			break;
    	}

		p++;
		dataLen--;
    }

	m_bUserLedUpdate = true;
	m_redValue = redValue;
	m_greenValue = greenValue;
	m_blueValue = blueValue;
#endif //0
}

#if VT_KW41Z_DEMO
/*!*************************************************************************************************
\private
\fn     void APP_CoapkeyeventCb(bool_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen)
\brief  This function is the callback function for CoAP message. It sends the KeyCount value in
a CoAP ACK message.

\param  [in]    sessionStatus   status for CoAP session
\param  [in]    pData           pointer to CoAP message payload
\param  [in]    pSession        pointer to CoAP session
\param  [in]    dataLen         length of CoAP payload

\return         void
***************************************************************************************************/
static void APP_CoapkeyeventCb
(
    coapSessionStatus_t sessionStatus,
    void *pData,
    coapSession_t *pSession,
    uint32_t dataLen
)
{
    uint8_t *pKeyEvent = NULL;
    uint32_t ackPloadSize = 0;
    char data_buffer[32];
    
    /* Send CoAP ACK */
    if (gCoapGET_c == pSession->code)
    {
        memset(data_buffer,0,32);
        sprintf(data_buffer,"key count : %d",key_event_count);
        pKeyEvent = (uint8_t *)&data_buffer[0];
        ackPloadSize = strlen((char*)pKeyEvent);
    }
    if (gCoapConfirmable_c == pSession->msgType)
    {
        if (gCoapGET_c == pSession->code)
        {
            COAP_Send(pSession, gCoapMsgTypeAckSuccessChanged_c, pKeyEvent, ackPloadSize);
        }
        else
        {
            COAP_Send(pSession, gCoapMsgTypeAckSuccessChanged_c, NULL, 0);
        }
    }

}

/*!*************************************************************************************************
\private
\fn     void APP_CoapresetCb(bool_t sessionStatus, void *pData, coapSession_t *pSession, uint32_t dataLen)
\brief  This function is the callback function for CoAP message. It performs the Factory reset
operation and sends back a CoAP ACK message.

\param  [in]    sessionStatus   status for CoAP session
\param  [in]    pData           pointer to CoAP message payload
\param  [in]    pSession        pointer to CoAP session
\param  [in]    dataLen         length of CoAP payload

\return         void
***************************************************************************************************/
static void APP_CoapresetCb
(
    coapSessionStatus_t sessionStatus,
    void *pData,
    coapSession_t *pSession,
    uint32_t dataLen
)
{
    /* Process the command only if it is a POST method */
    if ((sessionStatus == gCoapSuccess_c) && (pSession->code == gCoapPOST_c))
    {
        shell_write("Factory reset\r\n");
        THR_FactoryReset();
    }

    /* Send the reply if the status is Success or Duplicate */
    if ((gCoapFailure_c != sessionStatus) && (gCoapConfirmable_c == pSession->msgType))
    {
        /* Send CoAP ACK */
        COAP_Send(pSession, gCoapMsgTypeAckSuccessChanged_c, NULL, 0);
    }
}
#endif /* VT_KW41Z_DEMO */

/*!*************************************************************************************************
\private
\fn     static void APP_CoapTempCb(coapSessionStatus_t sessionStatus, void *pData,
                                   coapSession_t *pSession, uint32_t dataLen)
\brief  This function is the callback function for CoAP temperature message.
\brief  It sends the temperature value in a CoAP ACK message.

\param  [in]    sessionStatus   Status for CoAP session
\param  [in]    pData           Pointer to CoAP message payload
\param  [in]    pSession        Pointer to CoAP session
\param  [in]    dataLen         Length of CoAP payload
***************************************************************************************************/
static void APP_CoapTempCb
(
    coapSessionStatus_t sessionStatus,
    void *pData,
    coapSession_t *pSession,
    uint32_t dataLen
)
{
    uint8_t *pTempString = NULL;
    uint32_t ackPloadSize = 0, maxDisplayedString = 10;

    /* Send CoAP ACK */
    if(gCoapGET_c == pSession->code)
    {
        /* Get Temperature */
        pTempString = App_GetTempDataString();
        ackPloadSize = strlen((char*)pTempString);
    }
    /* Do not parse the message if it is duplicated */
    else if((gCoapPOST_c == pSession->code) && (sessionStatus == gCoapSuccess_c))
    {
        if(NULL != pData)
        {
            char addrStr[INET6_ADDRSTRLEN];
            uint8_t temp[10];

            ntop(AF_INET6, &pSession->remoteAddr, addrStr, INET6_ADDRSTRLEN);
            shell_write("\r");

            if(0 != dataLen)
            {
                /* Prevent from buffer overload */
                (dataLen >= maxDisplayedString) ? (dataLen = (maxDisplayedString - 1)) : (dataLen);
                temp[dataLen]='\0';
                FLib_MemCpy(temp,pData,dataLen);
                shell_printf((char*)temp);
            }
            shell_printf("\tFrom IPv6 Address: %s\n\r", addrStr);
            shell_refresh();
#ifdef VT_KW41Z_DEMO
            FLib_MemSet(addrStr, 0,INET6_ADDRSTRLEN );

            ntop(AF_INET6, &in6addr_realmlocal_allthreadnodes, addrStr, INET6_ADDRSTRLEN);
            shell_write("\r");
            shell_printf("\t IPv6 readlm: %s\n\r", addrStr);
            shell_refresh();
            shell_printf("\t IPv6 readlm0: %2X,%2X,%2X,%2X\n\r", in6addr_realmlocal_allthreadnodes.addr8[0],in6addr_realmlocal_allthreadnodes.addr8[1], in6addr_realmlocal_allthreadnodes.addr8[2], in6addr_realmlocal_allthreadnodes.addr8[4]);
            shell_printf("\t IPv6 readlm1: %2X,%2X,%2X,%2X\n\r", in6addr_realmlocal_allthreadnodes.addr8[4],in6addr_realmlocal_allthreadnodes.addr8[5], in6addr_realmlocal_allthreadnodes.addr8[6], in6addr_realmlocal_allthreadnodes.addr8[7]);
            shell_printf("\t IPv6 readlm2: %2X,%2X,%2X,%2X\n\r", in6addr_realmlocal_allthreadnodes.addr8[8],in6addr_realmlocal_allthreadnodes.addr8[9], in6addr_realmlocal_allthreadnodes.addr8[10], in6addr_realmlocal_allthreadnodes.addr8[11]);
            shell_printf("\t IPv6 readlm3: %2X,%2X,%2X,%2X\n\r", in6addr_realmlocal_allthreadnodes.addr8[12],in6addr_realmlocal_allthreadnodes.addr8[13], in6addr_realmlocal_allthreadnodes.addr8[14], in6addr_realmlocal_allthreadnodes.addr8[15]);
            shell_refresh();
#endif            
        }
    }

    if(gCoapConfirmable_c == pSession->msgType)
    {
        if(gCoapGET_c == pSession->code)
        {
            COAP_Send(pSession, gCoapMsgTypeAckSuccessChanged_c, pTempString, ackPloadSize);
        }
        else
        {
            COAP_Send(pSession, gCoapMsgTypeAckSuccessChanged_c, NULL, 0);
        }
    }

